tests/12_Case_Type_Slab_NS_Height_30_Dist_20_dir_0_crashed/0/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object epsilon;
        }

        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        dimensions [0 2 -3 0 0 0 0];
#include		"initialConditions";
internalField uniform $turbulentEpsilon;
boundaryField
{
    frontAndBack
    {
        type slip;
    }
    ground
    {
        type epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }
ground_perim
    {
        type epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }
building
    {
         type epsilonWallFunction;
         value		$internalField;
    }inlet
    {
                    type atmBoundaryLayerInletEpsilon;
# include	"ABLConditions";
                }
                outlet
    {
        type    inletOutlet;
        inletValue  $internalField;
        value   $internalField;
    }
}

// ************************************************************************* //
