tests/12_Case_Type_Slab_NS_Height_30_Dist_20_dir_0_crashed/0/0.org/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "0";
    object initialConditions;
        }

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
flowVelocity (0 0 0);
pressure    0;
turbulentKE 0.015;
turbulentEpsilon 0.135;
turbulentOmega	100;
#inputMode		merge;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
