tests/12_Case_Type_Slab_NS_Height_30_Dist_20_dir_0_crashed/system/decomposeParDict
// * * * * * * * * * //
            FoamFile
{
                version 0.5;
                format ascii;
                root "ROOT";
	case "CASE";

    class dictionary;
        object nix;
    }
    method scotch;
    numberOfSubdomains 14;
scotchCoeffs
{
}